
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>部署 · Flask之旅</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="12-handling_users.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="1-introduction.html">
            
                <a href="1-introduction.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="2-coding_conventions.html">
            
                <a href="2-coding_conventions.html">
            
                    
                    代码约定
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="3-environment.html">
            
                <a href="3-environment.html">
            
                    
                    环境
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="4-organizing_your_project.html">
            
                <a href="4-organizing_your_project.html">
            
                    
                    组织你的项目
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="5-configuration.html">
            
                <a href="5-configuration.html">
            
                    
                    配置
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="6-advanced_patterns_for_views_and_routing.html">
            
                <a href="6-advanced_patterns_for_views_and_routing.html">
            
                    
                    关于视图和路由的进阶技巧
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="7-blueprints.html">
            
                <a href="7-blueprints.html">
            
                    
                    蓝图
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="8-templates.html">
            
                <a href="8-templates.html">
            
                    
                    模板
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="9-static_files.html">
            
                <a href="9-static_files.html">
            
                    
                    静态文件
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="10-storing-data.html">
            
                <a href="10-storing-data.html">
            
                    
                    存储
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="11-handling_forms.html">
            
                <a href="11-handling_forms.html">
            
                    
                    处理表单
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="12-handling_users.html">
            
                <a href="12-handling_users.html">
            
                    
                    用户管理的规范
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.14" data-path="13-deployment.html">
            
                <a href="13-deployment.html">
            
                    
                    部署
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >部署</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><img src="images/deployment.png" alt="&#x90E8;&#x7F72;"></p>
<h1 id="&#x90E8;&#x7F72;">&#x90E8;&#x7F72;</h1>
<p>&#x6700;&#x7EC8;&#xFF0C;&#x4F60;&#x7EC8;&#x4E8E;&#x53EF;&#x4EE5;&#x5411;&#x5168;&#x4E16;&#x754C;&#x5C55;&#x793A;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x4E86;&#x3002;&#x662F;&#x65F6;&#x5019;&#x90E8;&#x7F72;&#x5B83;&#x4E86;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x603B;&#x80FD;&#x8BA9;&#x4EBA;&#x611F;&#x5230;&#x53D7;&#x632B;&#xFF0C;&#x56E0;&#x4E3A;&#x6709;&#x592A;&#x591A;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x3002;&#x540C;&#x65F6;&#x5728;&#x90E8;&#x7F72;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F60;&#x9700;&#x8981;&#x505A;&#x51FA;&#x592A;&#x591A;&#x8270;&#x96BE;&#x7684;&#x51B3;&#x5B9A;&#x3002;&#x6211;&#x4EEC;&#x4F1A;&#x8C08;&#x8BBA;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7684;&#x5730;&#x65B9;&#x4EE5;&#x53CA;&#x6211;&#x4EEC;&#x4E00;&#x4E9B;&#x53EF;&#x80FD;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
<h2 id="&#x6258;&#x7BA1;&#x4E3B;&#x673A;">&#x6258;&#x7BA1;&#x4E3B;&#x673A;</h2>
<p>&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E16;&#x4E0A;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x5546;&#x6210;&#x5343;&#xFF0C;&#x4F46;&#x6211;&#x53EA;&#x53D6;&#x4E09;&#x5BB6;&#x3002;&#x6211;&#x4E0D;&#x4F1A;&#x8C08;&#x8BBA;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x8D85;&#x51FA;&#x672C;&#x4E66;&#x7684;&#x8303;&#x56F4;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6211;&#x53EA;&#x4F1A;&#x8C08;&#x8BBA;&#x5B83;&#x4EEC;&#x4F5C;&#x4E3A;Flask&#x5E94;&#x7528;&#x6258;&#x7BA1;&#x5546;&#x4E0A;&#x7684;&#x4F18;&#x70B9;&#x3002;</p>
<h3 id="amazon-web-services-ec2&#xFF08;&#x56E0;&#x4E3A;&#x56FD;&#x60C5;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x770B;&#x4E0B;&#x4E00;&#x4E2A;&#x5427;&#xFF09;">Amazon Web Services EC2&#xFF08;&#x56E0;&#x4E3A;&#x56FD;&#x60C5;&#x95EE;&#x9898;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x76F4;&#x63A5;&#x770B;&#x4E0B;&#x4E00;&#x4E2A;&#x5427;&#xFF09;</h3>
<p>Amazon Web Services&#x6307;&#x7684;&#x662F;&#x4E00;&#x5957;&#x76F8;&#x5173;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x63D0;&#x4F9B;&#x5546;&#x662F;&#x2026;&#x2026;<del>&#x5353;&#x8D8A;</del>&#x4E9A;&#x9A6C;&#x900A;&#xFF01;&#x4ECA;&#x65E5;&#xFF0C;&#x8BB8;&#x591A;&#x8457;&#x540D;&#x7684;&#x521D;&#x521B;&#x516C;&#x53F8;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x6216;&#x8BB8;&#x5DF2;&#x7ECF;&#x542C;&#x8FC7;&#x5B83;&#x7684;&#x5927;&#x540D;&#x3002;AWS&#x670D;&#x52A1;&#x4E2D;&#x6211;&#x4EEC;&#x6700;&#x5173;&#x5FC3;&#x7684;&#x662F;EC2&#xFF0C;&#x5168;&#x79F0;&#x662F;Elastic Compute Cloud&#x3002;EC2&#x7684;&#x6700;&#x5927;&#x7684;&#x5356;&#x70B9;&#x662F;&#x4F60;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#x5B9E;&#x4F8B;&#xFF08;&#x8FD9;&#x662F;AWS&#x5B98;&#x65B9;&#x79F0;&#x547C;&#xFF09;&#xFF0C;&#x5728;&#x4EC5;&#x4EC5;&#x51E0;&#x79D2;&#x4E4B;&#x5185;&#x3002;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x5FEB;&#x901F;&#x62D3;&#x5C55;&#x4F60;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5C31;&#x53EA;&#x9700;&#x542F;&#x52A8;&#x591A;&#x4E00;&#x70B9;EC2&#x5B9E;&#x4F8B;&#x7ED9;&#x4F60;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x7528;&#x4E00;&#x4E2A;&#x8D1F;&#x8F7D;&#x5E73;&#x8861;&#x5668;(load balancer)&#x7BA1;&#x7406;&#x5B83;&#x4EEC;&#x3002;&#xFF08;&#x8FD9;&#x65F6;&#x8FD8;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;AWS Elastic Load Balancer&#xFF09;</p>
<p>&#x5BF9;&#x4E8E;Flask&#x800C;&#x8A00;&#xFF0C;AWS&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x7684;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#x3002;&#x4ED8;&#x4E0A;&#x4E00;&#x4E9B;&#x8D39;&#x7528;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x4F60;&#x559C;&#x6B22;&#x7684;Linux&#x53D1;&#x884C;&#x7248;&#x542F;&#x52A8;&#x5B83;&#xFF0C;&#x5E76;&#x5B89;&#x4E0A;&#x4F60;&#x7684;Flask&#x5E94;&#x7528;&#x3002;&#x4E4B;&#x540E;&#x4F60;&#x7684;&#x670D;&#x52A1;&#x5668;&#x5C31;&#x8D77;&#x6765;&#x4E86;&#x3002;&#x4E0D;&#x8FC7;&#x5B83;&#x610F;&#x5473;&#x7740;&#x4F60;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x77E5;&#x8BC6;&#x3002;</p>
<h3 id="heroku">Heroku</h3>
<p>Heroku&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x6258;&#x7BA1;&#x7F51;&#x7AD9;&#xFF0C;&#x57FA;&#x4E8E;&#x8BF8;&#x5982;EC2&#x7684;AWS&#x7684;&#x670D;&#x52A1;&#x3002;&#x4ED6;&#x4EEC;&#x5141;&#x8BB8;&#x4F60;&#x83B7;&#x5F97;EC2&#x7684;&#x4FBF;&#x5229;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;Heroku&#xFF0C;&#x4F60;&#x901A;&#x8FC7;<code>git push</code>&#x6765;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x90E8;&#x7F72;&#x4EE3;&#x7801;&#x3002;&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x4FBF;&#x5229;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x60F3;&#x6D6A;&#x8D39;&#x65F6;&#x95F4;ssh&#x5230;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x5B89;&#x88C5;&#x5E76;&#x914D;&#x7F6E;&#x8F6F;&#x4EF6;&#xFF0C;&#x7EE7;&#x7EED;&#x6574;&#x4E2A;&#x5E38;&#x89C4;&#x7684;&#x90E8;&#x7F72;&#x6D41;&#x7A0B;&#x3002;&#x8FD9;&#x79CD;&#x4FBF;&#x5229;&#x662F;&#x9700;&#x8981;&#x82B1;&#x94B1;&#x8D2D;&#x4E70;&#x7684;&#xFF0C;&#x5C3D;&#x7BA1;AWS&#x548C;Heroku&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5B9A;&#x91CF;&#x7684;&#x514D;&#x8D39;&#x670D;&#x52A1;&#x3002;</p>
<blockquote>
<p><strong>&#x53C2;&#x89C1;</strong>
Heroku&#x6709;&#x4E00;&#x4E2A;&#x5982;&#x4F55;&#x5728;&#x5B83;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x90E8;&#x7F72;Flask&#x5E94;&#x7528;&#x7684;&#x6559;&#x7A0B;&#xFF1A; 
<a href="https://devcenter.heroku.com/articles/getting-started-with-python" target="_blank">https://devcenter.heroku.com/articles/getting-started-with-python</a></p>
<p><strong>&#x6CE8;&#x610F;</strong>
&#x7BA1;&#x7406;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5C06;&#x4F1A;&#x82B1;&#x4E0A;&#x8BB8;&#x591A;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x628A;&#x5B83;&#x505A;&#x597D;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x7ECF;&#x9A8C;&#x3002;&#x901A;&#x8FC7;&#x914D;&#x7F6E;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x7AD9;&#x70B9;&#x6765;&#x5B66;&#x4E60;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x662F;&#x597D;&#x7684;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x60F3;&#x8981;&#x5916;&#x5305;&#x7ED9;&#x4E13;&#x4E1A;&#x56E2;&#x961F;&#x6765;&#x7701;&#x4E0B;&#x65F6;&#x95F4;&#x548C;&#x7CBE;&#x529B;&#x3002;Heroku&#x548C;AWS&#x90FD;&#x63D0;&#x4F9B;&#x6709;&#x6570;&#x636E;&#x5E93;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x8FD8;&#x6CA1;&#x8BD5;&#x8FC7;&#xFF0C;&#x4F46;&#x542C;&#x8BF4;&#x5B83;&#x4EEC;&#x4E0D;&#x9519;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x4FDD;&#x969C;&#x6570;&#x636E;&#x5B89;&#x5168;&#x4EE5;&#x53CA;&#x5907;&#x4EFD;&#xFF0C;&#x5374;&#x53C8;&#x4E0D;&#x60F3;&#x8981;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#xFF0C;&#x503C;&#x5F97;&#x8003;&#x8651;&#x4E00;&#x4E0B;&#x5B83;&#x4EEC;&#x3002;</p>
<ul>
<li>Heroku Postgres: <a href="https://www.heroku.com/postgres" target="_blank">https://www.heroku.com/postgres</a></li>
<li>Amazon RDS: <a href="https://aws.amazon.com/rds/" target="_blank">https://aws.amazon.com/rds/</a></li>
</ul>
</blockquote>
<h3 id="digital-ocean">Digital Ocean</h3>
<p>Digital Ocean&#x662F;&#x6700;&#x8FD1;&#x51FA;&#x73B0;&#x7684;EC2&#x7684;&#x7ADE;&#x4E89;&#x5BF9;&#x624B;&#x3002;&#x4E00;&#x5982;EC2&#xFF0C;Digital Ocean&#x5141;&#x8BB8;&#x4F60;&#x5FEB;&#x901F;&#x5730;&#x542F;&#x52A8;&#x865A;&#x62DF;&#x4E3B;&#x673A;&#xFF08;&#x5728;&#x8FD9;&#x91CC;&#x53EB;droplet&#xFF09;&#x3002;&#x6240;&#x6709;&#x7684;droplet&#x90FD;&#x8FD0;&#x884C;&#x5728;SSD&#x4E0A;&#xFF0C;&#x800C;&#x5728;EC2&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7528;&#x7684;&#x662F;&#x666E;&#x901A;&#x670D;&#x52A1;&#xFF0C;&#x4F60;&#x662F;&#x4EAB;&#x53D7;&#x4E0D;&#x5230;&#x8FD9;&#x79CD;&#x5F85;&#x9047;&#x7684;&#x3002;&#x5BF9;&#x6211;&#x800C;&#x8A00;&#xFF0C;&#x6700;&#x5927;&#x7684;&#x5356;&#x70B9;&#x662F;&#x5B83;&#x63D0;&#x4F9B;&#x7684;&#x63A7;&#x5236;&#x63A5;&#x53E3;&#x6BD4;AWS&#x63A7;&#x5236;&#x9762;&#x677F;&#x7B80;&#x5355;&#x548C;&#x5BB9;&#x6613;&#x591A;&#x4E86;&#x3002;Digital Ocean&#x662F;&#x6211;&#x4E2A;&#x4EBA;&#x7684;&#x6700;&#x7231;&#xFF0C;&#x6211;&#x5EFA;&#x8BAE;&#x4F60;&#x8003;&#x8651;&#x4E0B;&#x5B83;&#x3002;</p>
<p>&#x5728;Digital Ocean&#xFF0C;Flask&#x5E94;&#x7528;&#x90E8;&#x7F72;&#x65B9;&#x5F0F;&#x5C31;&#x8DDF;&#x5728;EC2&#x4E00;&#x6837;&#x3002;&#x4F60;&#x4F1A;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;Linux&#x53D1;&#x884C;&#x7248;&#xFF0C;&#x7136;&#x540E;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4F60;&#x7684;&#x5168;&#x5957;&#x8F6F;&#x4EF6;&#x3002;</p>
<h2 id="&#x90E8;&#x7F72;&#x5DE5;&#x5177;">&#x90E8;&#x7F72;&#x5DE5;&#x5177;</h2>
<p>&#x8FD9;&#x4E00;&#x8282;&#x5C06;&#x5305;&#x62EC;&#x4E00;&#x4E9B;&#x4E3A;&#x4E86;&#x5411;&#x522B;&#x4EBA;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x6700;&#x57FA;&#x672C;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x524D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x7528;&#x6765;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x8BF7;&#x6C42;&#x7ED9;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x4F60;&#x7684;Flask&#x5E94;&#x7528;&#x7684;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#x3002;&#x4F60;&#x901A;&#x5E38;&#x4E5F;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x4E5F;&#x4F1A;&#x7565;&#x5FAE;&#x8C08;&#x8BBA;&#x4E0B;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<h3 id="&#x5E94;&#x7528;&#x5BB9;&#x5668;">&#x5E94;&#x7528;&#x5BB9;&#x5668;</h3>
<p>&#x5728;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x672C;&#x5730;&#x8FD0;&#x884C;&#x7684;&#x90A3;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x5E76;&#x4E0D;&#x80FD;&#x5904;&#x7406;&#x771F;&#x5B9E;&#x7684;&#x8BF7;&#x6C42;&#x3002;&#x5F53;&#x4F60;&#x771F;&#x7684;&#x9700;&#x8981;&#x5411;&#x516C;&#x4F17;&#x53D1;&#x5E03;&#x4F60;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#xFF0C;&#x4F8B;&#x5982;Gunicorn&#xFF0C;&#x4E0A;&#x8FD0;&#x884C;&#x5B83;&#x3002;Gunicorn&#x63A5;&#x5F85;&#x8BF7;&#x6C42;&#xFF0C;&#x5E76;&#x5904;&#x7406;&#x8BF8;&#x5982;&#x7EBF;&#x7A0B;&#x7684;&#x590D;&#x6742;&#x4E8B;&#x52A1;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x4F7F;&#x7528;Gunicorn&#xFF0C;&#x9700;&#x8981;&#x901A;&#x8FC7;pip&#x5B89;&#x88C5;<code>gunicorn</code>&#x5230;&#x4F60;&#x7684;&#x865A;&#x62DF;&#x73AF;&#x5883;&#x4E2D;&#x3002;&#x8FD0;&#x884C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x53EA;&#x9700;&#x7B80;&#x5355;&#x7684;&#x547D;&#x4EE4;&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x660E;&#x8D77;&#x89C1;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x7684;Flask&#x5E94;&#x7528;&#xFF1A;</p>
<p><em>rocket.py</em></p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask

app = Flask(__name__)

<span class="hljs-meta">@app.route(&apos;/&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">index</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello World!&quot;</span>
</code></pre>
<p>&#x54E6;&#xFF0C;&#x8FD9;&#x771F;&#x7B80;&#x660E;&#x627C;&#x8981;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x4F7F;&#x7528;Gunicorn&#x6765;&#x8FD0;&#x884C;&#x5B83;&#x5427;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x9700;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code>(ourapp)$ gunicorn rocket:app
2014-03-19 16:28:54 [62924] [INFO] Starting gunicorn 18.0
2014-03-19 16:28:54 [62924] [INFO] Listening at: http://127.0.0.1:8000 (62924)
2014-03-19 16:28:54 [62924] [INFO] Using worker: sync
2014-03-19 16:28:54 [62927] [INFO] Booting worker with pid: 62927
</code></pre><p>&#x4F60;&#x5E94;&#x8BE5;&#x80FD;&#x5728; <a href="http://127.0.0.1:8000" target="_blank">http://127.0.0.1:8000</a> &#x770B;&#x5230;&#x201C;Hello World!&#x201D;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#x8FD9;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#xFF08;&#x4E5F;&#x5373;&#x4F7F;&#x5B83;&#x53D8;&#x6210;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F20;&#x9012;<code>-D</code>&#x9009;&#x9879;&#x7ED9;Gunicorn&#x3002;&#x8FD9;&#x4E0B;&#x5B83;&#x4F1A;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#xFF0C;&#x5373;&#x4F7F;&#x4F60;&#x5173;&#x95ED;&#x4E86;&#x5F53;&#x524D;&#x7684;&#x7EC8;&#x7AEF;&#x4F1A;&#x8BDD;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8FD9;&#x4E48;&#x505A;&#x4E86;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x60F3;&#x8981;&#x5173;&#x95ED;&#x670D;&#x52A1;&#x5668;&#x65F6;&#x5C31;&#x4F1A;&#x56F0;&#x60D1;&#x4E8E;&#x5230;&#x5E95;&#x5E94;&#x8BE5;&#x5173;&#x95ED;&#x54EA;&#x4E2A;&#x8FDB;&#x7A0B;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA9;Gunicorn&#x628A;&#x8FDB;&#x7A0B;ID&#x50A8;&#x5B58;&#x5230;&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x5982;&#x679C;&#x60F3;&#x8981;&#x505C;&#x6B62;&#x6216;&#x8005;&#x91CD;&#x542F;&#x670D;&#x52A1;&#x5668;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0D;&#x7528;&#x5728;&#x4E00;&#x5927;&#x4E32;&#x8FD0;&#x884C;&#x4E2D;&#x7684;&#x8FDB;&#x7A0B;&#x4E2D;&#x641C;&#x7D22;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;<code>-p &lt;file&gt;</code>&#x9009;&#x9879;&#x6765;&#x8FD9;&#x4E48;&#x505A;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x7684;Gunicorn&#x90E8;&#x7F72;&#x547D;&#x4EE4;&#x662F;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -D
(ourapp)$ cat rocket.pid
63101
</code></pre><p>&#x8981;&#x60F3;&#x91CD;&#x65B0;&#x542F;&#x52A8;&#x6216;&#x8005;&#x5173;&#x95ED;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x5BF9;&#x5E94;&#x7684;&#x547D;&#x4EE4;&#xFF1A;</p>
<pre><code>(ourapp)$ kill -HUP `cat rocket.pid` # &#x53D1;&#x9001;&#x4E00;&#x4E2A;SIGHUP&#x4FE1;&#x53F7;&#xFF0C;&#x7EC8;&#x6B62;&#x8FDB;&#x7A0B;
(ourapp)$ kill `cat rocket.pid`
</code></pre><p>&#x9ED8;&#x8BA4;&#x4E0B;Gunicorn&#x4F1A;&#x8FD0;&#x884C;&#x5728;8000&#x7AEF;&#x53E3;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x5DF2;&#x7ECF;&#x88AB;&#x53E6;&#x5916;&#x7684;&#x5E94;&#x7528;&#x5360;&#x7528;&#x4E86;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6DFB;&#x52A0;<code>-b</code>&#x9009;&#x9879;&#x6765;&#x6307;&#x5B9A;&#x7AEF;&#x53E3;&#x3002;</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -b 127.0.0.1:7999 -D
</code></pre><h4 id="&#x5C06;gunicorn&#x6446;&#x4E0A;&#x524D;&#x53F0;">&#x5C06;Gunicorn&#x6446;&#x4E0A;&#x524D;&#x53F0;</h4>
<blockquote>
<p><strong>&#x6CE8;&#x610F;</strong>
Gunicorn&#x5E94;&#x8BE5;&#x9690;&#x85CF;&#x4E8E;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x4E4B;&#x540E;&#x3002;&#x5982;&#x679C;&#x4F60;&#x76F4;&#x63A5;&#x8BA9;&#x5B83;&#x76D1;&#x542C;&#x6765;&#x81EA;&#x5916;&#x7F51;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x5B83;&#x5F88;&#x5BB9;&#x6613;&#x6210;&#x4E3A;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x7684;&#x76EE;&#x6807;&#x3002;&#x5B83;&#x4E0D;&#x5E94;&#x8BE5;&#x63A5;&#x53D7;&#x8FD9;&#x6837;&#x7684;&#x8003;&#x9A8C;&#x3002;&#x53EA;&#x6709;&#x5728;debug&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4F60;&#x624D;&#x80FD;&#x628A;Gunicorn&#x6446;&#x4E0A;&#x524D;&#x53F0;&#xFF0C;&#x800C;&#x4E14;&#x5B8C;&#x5DE5;&#x4E4B;&#x540E;&#xFF0C;&#x5207;&#x8BB0;&#x628A;&#x5B83;&#x91CD;&#x65B0;&#x9690;&#x85CF;&#x5230;&#x5E55;&#x540E;&#x3002; }</p>
</blockquote>
<p>&#x5982;&#x679C;&#x4F60;&#x50CF;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x8FD0;&#x884C;Gunicorn&#xFF0C;&#x5C06;&#x4E0D;&#x80FD;&#x4ECE;&#x672C;&#x5730;&#x7CFB;&#x7EDF;&#x4E2D;&#x8BBF;&#x95EE;&#x5230;&#x5B83;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x9ED8;&#x8BA4;&#x60C5;&#x51B5;&#x4E0B;Gunicorn&#x7ED1;&#x5B9A;&#x5728;127.0.0.1&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EC5;&#x4EC5;&#x76D1;&#x542C;&#x6765;&#x81EA;&#x670D;&#x52A1;&#x5668;&#x81EA;&#x8EAB;&#x7684;&#x8FDE;&#x63A5;&#x3002;&#x6240;&#x4EE5;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x6765;&#x4F5C;&#x4E3A;&#x5916;&#x7F51;&#x548C;Gunicorn&#x670D;&#x52A1;&#x5668;&#x7684;&#x4E2D;&#x4ECB;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5047;&#x5982;&#x4E3A;&#x4E86;debug&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x76F4;&#x63A5;&#x4ECE;&#x5916;&#x7F51;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7ED9;Gunicorn&#xFF0C;&#x53EF;&#x4EE5;&#x544A;&#x8BC9;Gunicorn&#x7ED1;&#x5B9A;0.0.0.0&#x3002;&#x8FD9;&#x6837;&#x5B83;&#x5C31;&#x4F1A;&#x76D1;&#x542C;&#x6240;&#x6709;&#x8BF7;&#x6C42;&#x3002;</p>
<pre><code>(ourapp)$ gunicorn rocket:app -p rocket.pid -b 0.0.0.0:8000 -D
</code></pre><blockquote>
<p><strong>&#x6CE8;&#x610F;</strong></p>
<ul>
<li>&#x4ECE;&#x6587;&#x6863;&#x4E2D;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x8FD0;&#x884C;&#x548C;&#x90E8;&#x7F72;Gunicorn&#x7684;&#x4FE1;&#x606F; : <a href="http://docs.gunicorn.org/en/latest/" target="_blank">http://docs.gunicorn.org/en/latest/</a> </li>
<li>Fabric&#x662F;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x4F60;&#x4E0D;&#x901A;&#x8FC7;SSH&#x8FDE;&#x63A5;&#x5230;&#x6BCF;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5C31;&#x53EF;&#x4EE5;&#x6267;&#x884C;&#x90E8;&#x7F72;&#x548C;&#x7BA1;&#x7406;&#x547D;&#x4EE4;&#x7684;&#x5DE5;&#x5177; : <a href="http://docs.fabfile.org/en/latest" target="_blank">http://docs.fabfile.org/en/latest</a></li>
</ul>
</blockquote>
<h3 id="nginx&#x53CD;&#x5411;&#x4EE3;&#x7406;">Nginx&#x53CD;&#x5411;&#x4EE3;&#x7406;</h3>
<p>&#x53CD;&#x5411;&#x4EE3;&#x7406;&#x5904;&#x7406;&#x516C;&#x5171;&#x7684;HTTP&#x8BF7;&#x6C42;&#xFF0C;&#x53D1;&#x9001;&#x7ED9;Gunicorn&#x5E76;&#x5C06;&#x54CD;&#x5E94;&#x5E26;&#x56DE;&#x7ED9;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x3002;Nginx&#x662F;&#x4E00;&#x4E2A;&#x4F18;&#x79C0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x66F4;&#x4F55;&#x51B5;Gunicorn&#x5F3A;&#x70C8;&#x5EFA;&#x8BAE;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x5B83;&#x3002;</p>
<p>&#x8981;&#x60F3;&#x914D;&#x7F6E;Nginx&#x4F5C;&#x4E3A;&#x8FD0;&#x884C;&#x5728;127.0.0.1:8000&#x7684;Gunicorn&#x7684;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;<em>/etc/nginx/sites-available</em>&#x4E0B;&#x7ED9;&#x5E94;&#x7528;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x4E0D;&#x5982;&#x79F0;&#x4E4B;&#x4E3A;<em>exploreflask.com</em>&#x5427;&#x3002;</p>
<p><em>/etc/nginx/sites-available/exploreflask.com</em></p>
<pre><code># Redirect www.exploreflask.com to exploreflask.com
server {
        server_name www.exploreflask.com;
        rewrite ^ http://exploreflask.com/ permanent;
}

# Handle requests to exploreflask.com on port 80
server {
        listen 80;
        server_name exploreflask.com;

        # Handle all locations
        location / {
                # Pass the request to Gunicorn
                proxy_pass http://127.0.0.1:8000;

                # Set some HTTP headers so that our app knows where the request really came from
                proxy_set_header Host $host;
                proxy_set_header X-Real-IP $remote_addr;
                proxy_set_header X-Forwarded-For $proxy_add_x_forwarded_for;
        }
}
</code></pre><p>&#x73B0;&#x5728;&#x5728;<em>/etc/nginx/sites-enabled</em>&#x4E0B;&#x521B;&#x5EFA;&#x8BE5;&#x6587;&#x4EF6;&#x7684;&#x7B26;&#x53F7;&#x94FE;&#x63A5;&#xFF0C;&#x63A5;&#x7740;&#x91CD;&#x542F;Nginx&#x3002;</p>
<pre><code>$ sudo ln -s \
/etc/nginx/sites-available/exploreflask.com \
/etc/nginx/sites-enabled/exploreflask.com
</code></pre><p>&#x4F60;&#x73B0;&#x5728;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x8BF7;&#x6C42;&#x7ED9;Nginx&#x7136;&#x540E;&#x6536;&#x5230;&#x6765;&#x81EA;&#x5E94;&#x7528;&#x7684;&#x54CD;&#x5E94;&#x3002;</p>
<blockquote>
<p><strong>&#x53C2;&#x89C1;</strong>
Gunicorn&#x6587;&#x6863;&#x4E2D;&#x5173;&#x4E8E;&#x914D;&#x7F6E;Nginx&#x7684;&#x90E8;&#x5206;&#x4F1A;&#x7ED9;&#x4F60;&#x66F4;&#x591A;&#x542F;&#x52A8;Nginx&#x7684;&#x4FE1;&#x606F;: 
<a href="http://docs.gunicorn.org/en/latest/deploy.html#nginx-configuration" target="_blank">http://docs.gunicorn.org/en/latest/deploy.html#nginx-configuration</a></p>
</blockquote>
<h4 id="proxyfix">ProxyFix</h4>
<p>&#x6709;&#x65F6;&#xFF0C;&#x4F60;&#x4F1A;&#x9047;&#x5230;Flask&#x4E0D;&#x80FD;&#x6070;&#x5F53;&#x5904;&#x7406;&#x8F6C;&#x53D1;&#x7684;&#x8BF7;&#x6C42;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x8FD9;&#x4E5F;&#x8BB8;&#x662F;&#x56E0;&#x4E3A;&#x5728;Nginx&#x4E2D;&#x8BBE;&#x7F6E;&#x7684;&#x67D0;&#x4E9B;HTTP&#x62A5;&#x6587;&#x5934;&#x90E8;&#x9020;&#x6210;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Werkzeug&#x7684;ProxyFix&#x6765;fix&#x8F6C;&#x53D1;&#x8BF7;&#x6C42;&#x3002;</p>
<p><em>app.py</em></p>
<pre><code class="lang-python"><span class="hljs-keyword">from</span> flask <span class="hljs-keyword">import</span> Flask

<span class="hljs-comment"># Import the fixer</span>
<span class="hljs-keyword">from</span> werkzeug.contrib.fixers <span class="hljs-keyword">import</span> ProxyFix

app = Flask(__name__)

<span class="hljs-comment"># Use the fixer</span>
app.wsgi_app = ProxyFix(app.wsgi_app)

<span class="hljs-meta">@app.route(&apos;/&apos;)</span>
<span class="hljs-function"><span class="hljs-keyword">def</span> <span class="hljs-title">index</span><span class="hljs-params">()</span>:</span>
    <span class="hljs-keyword">return</span> <span class="hljs-string">&quot;Hello World!&quot;</span>
</code></pre>
<blockquote>
<p><strong>&#x53C2;&#x89C1;</strong>
&#x5728;Werkzeug&#x6587;&#x6863;&#x4E2D;&#x53EF;&#x4EE5;&#x8BFB;&#x5230;&#x66F4;&#x591A;&#x5173;&#x4E8E;ProxyFix&#x7684;&#x4FE1;&#x606F;: 
<a href="http://werkzeug.pocoo.org/docs/contrib/fixers/#werkzeug.contrib.fixers.ProxyFix" target="_blank">http://werkzeug.pocoo.org/docs/contrib/fixers/#werkzeug.contrib.fixers.ProxyFix</a></p>
</blockquote>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<ul>
<li>&#x4F60;&#x53EF;&#x4EE5;&#x628A;Flask&#x5E94;&#x7528;&#x6258;&#x7BA1;&#x5230;AWS EC2&#xFF0C; Heroku&#x548C;Digital Ocean&#x3002;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x5EFA;&#x8BAE;&#x6258;&#x7BA1;&#x5230;&#x56FD;&#x5185;&#x7684;&#x4E91;&#x5E73;&#x53F0;&#x4E0A;&#xFF09;</li>
<li>Flask&#x5E94;&#x7528;&#x7684;&#x57FA;&#x672C;&#x90E8;&#x7F72;&#x4F9D;&#x8D56;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x5BB9;&#x5668;&#xFF08;&#x6BD4;&#x5982;Gunicorn&#xFF09;&#x548C;&#x4E00;&#x4E2A;&#x53CD;&#x5411;&#x4EE3;&#x7406;&#xFF08;&#x6BD4;&#x5982;Nginx&#xFF09;&#x3002;</li>
<li>Gunicorn&#x5E94;&#x8BE5;&#x9000;&#x5C45;Nginx&#x5E55;&#x540E;&#x5E76;&#x76D1;&#x542C;127.0.0.1&#xFF08;&#x5185;&#x90E8;&#x8BF7;&#x6C42;&#xFF09;&#x800C;&#x975E;0.0.0.0&#xFF08;&#x5916;&#x90E8;&#x8BF7;&#x6C42;&#xFF09;</li>
<li>&#x4F7F;&#x7528;Werkzeug&#x7684;ProxyFix&#x6765;&#x5904;&#x7406;Flask&#x5E94;&#x7528;&#x9047;&#x5230;&#x7684;&#x7279;&#x5B9A;&#x7684;&#x8F6C;&#x53D1;&#x62A5;&#x6587;&#x5934;&#x90E8;&#x3002;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="12-handling_users.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 用户管理的规范">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"部署","level":"1.14","depth":1,"previous":{"title":"用户管理的规范","level":"1.13","depth":1,"path":"12-handling_users.md","ref":"12-handling_users.md","articles":[]},"dir":"ltr"},"config":{"plugins":[],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"fontSettings":{"theme":"sepia","family":"sans","size":2},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":22,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Flask之旅","links":{"sharing":{"google":null,"facebook":null,"twitter":null,"weibo":null,"all":null}},"gitbook":">=2.2.0","description":"关于Flask的最佳实践","extension":null},"file":{"path":"13-deployment.md","mtime":"2019-03-06T02:56:12.752Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-03-06T02:59:11.053Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

